export class Stage{
    constructor(stageLevel, stageWidth, stageHeight){
        this.stageLevel = stageLevel;
        this.wallsXCount = 24;
        this.wallsYCount = 6;
        this.wallsWidth_horizontal = stageWidth/24;
        this.wallsHeight_horizontal = stageHeight/60; 
        this.walls =[
            [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
            [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
            [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
            [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
            [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
            [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
        ]
    
        //벽돌에 대한 정의
        this.wall_horizontal=[
            [1,2,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
            [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
            [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
            [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
            [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
            [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],
        ]
        this.walls_hor_X=[
            [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
            [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
            [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
            [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
            [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
            [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
        ]
        this.walls_hor_Y=[
            [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
            [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
            [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
            [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
            [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
            [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],
        ]
        //for 반복문으로 실제값 생성, let을 사용
        this.x = 0; this.y = stageHeight/20;
        for(let i = 0; i < this.wall_horizontal.length; i++){
            this.y += stageHeight*12/7;
            for(let j = 0; j < this.wall_horizontal[i].length; j++){
                this.walls[i][j] = this.wall_horizontal[i][j];
               
                this.walls_hor_X[i][j]=this.x;
                this.walls_hor_Y[i][j]=this.y;
                
                //좌표 증감
                this.x += stageWidth/24;
                
            }
        }



    }

    draw(ctx, stageWidth, stageHeight){
        if(this.stageLevel == 1){
        ctx.fillStyle = 'brown';
        ctx.strokeRect(50, 50, this.wallsWidth_horizontal, this.wallsHeight_horizontal);
        }
        if(this.stageLevel == 2){
            ctx.fillStyle = 'brown';
            ctx.strokeRect(150, 50, 100, 30),
            ctx.strokeRect(250,50,100,30);}
    }
}